[
    {
        "image": "/wa.jpg",
        "title": "WhatsApp Messenger",
        "companyName": "Meta Platforms, Inc.",
        "id": 1,
        "description": "WhatsApp Messenger is one of the most widely used messaging apps globally, connecting billions of users across the world with fast, reliable, and secure communication. It allows sending instant messages, images, videos, voice notes, and documents, while ensuring privacy through end-to-end encryption. Users can create and participate in group chats, make voice and video calls, share status updates, and use communities for topic-based discussions. Businesses also use WhatsApp Business to communicate with customers, send notifications, and manage support queries efficiently. The app continuously improves with regular updates that enhance performance, security, user experience, and introduce innovative features like multi-device support, disappearing messages, dark mode, chat backups, and advanced media sharing options. WhatsApp is not just a communication tool but a global platform that empowers personal and professional connections, making everyday communication seamless, secure, and versatile.",
        "size": 303.4,
        "reviews": "1.1M",
        "ratingAvg": 4.27,
        "downloads": "5B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 33329
            },
            {
                "name": "2 star",
                "count": 44439
            },
            {
                "name": "3 star",
                "count": 88877
            },
            {
                "name": "4 star",
                "count": 388836
            },
            {
                "name": "5 star",
                "count": 645479
            }
        ]
    },
    {
        "image": "/facebook.jpg",
        "title": "Facebook",
        "companyName": "Meta Platforms, Inc.",
        "id": 2,
        "description": "Facebook is a globally popular social networking platform that allows users to stay connected with friends, family, and communities. Users can create profiles, post updates, share photos and videos, join groups, and discover content tailored to their interests. The platform also provides tools for businesses to engage with audiences, advertise products, and analyze insights. Facebook integrates features such as Marketplace, Events, Stories, and Reels, supporting both social interaction and professional networking. Regular updates ensure enhanced security, improved user experience, and the introduction of innovative features, making Facebook a versatile hub for social communication, content sharing, and digital engagement.",
        "size": 50.5,
        "reviews": "423K",
        "ratingAvg": 4.27,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 12696
            },
            {
                "name": "2 star",
                "count": 16928
            },
            {
                "name": "3 star",
                "count": 33857
            },
            {
                "name": "4 star",
                "count": 148123
            },
            {
                "name": "5 star",
                "count": 223504
            }
        ]
    },
    {
        "image": "/instra.jpg",
        "title": "Instagram",
        "companyName": "Meta Platforms, Inc.",
        "id": 3,
        "description": "Instagram is a widely used social media platform for sharing photos, videos, and stories, enabling users to connect, explore, and discover content globally. It offers features such as reels, live streaming, IGTV for long-form videos, and direct messaging. Instagram empowers creators to build their audience, monetize content, and engage with followers through interactive tools and analytics. The platform also provides privacy settings, content filters, and personalized recommendations. Regular updates bring enhanced performance, user interface improvements, and new creative tools, making Instagram a dynamic ecosystem for social connection, visual storytelling, and professional networking.",
        "size": 42.8,
        "reviews": "350K",
        "ratingAvg": 4.27,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 10513
            },
            {
                "name": "2 star",
                "count": 14017
            },
            {
                "name": "3 star",
                "count": 28034
            },
            {
                "name": "4 star",
                "count": 122651
            },
            {
                "name": "5 star",
                "count": 184219
            }
        ]
    },
    {
        "image": "/TikTok.png",
        "title": "TikTok",
        "companyName": "TikTok Pte. Ltd.",
        "id": 4,
        "description": "TikTok is a global short-video platform where users create, share, and discover videos ranging from entertainment, education, music, comedy, to challenges. The app uses advanced AI for personalized recommendations, making content discovery highly engaging. Creators can grow their audience, monetize content, and use tools such as analytics, live streaming, and editing features. TikTok supports collaborations, trends, and interactive experiences. Continuous updates enhance performance, security, and user experience, keeping TikTok one of the leading platforms for creativity, entertainment, and digital expression worldwide.",
        "size": 92.3,
        "reviews": "2.35M",
        "ratingAvg": 4.27,
        "downloads": "5B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 70573
            },
            {
                "name": "2 star",
                "count": 94098
            },
            {
                "name": "3 star",
                "count": 188196
            },
            {
                "name": "4 star",
                "count": 823354
            },
            {
                "name": "5 star",
                "count": 1171219
            }
        ]
    },
    {
        "image": "/YouTube.png",
        "title": "YouTube",
        "companyName": "Google LLC",
        "id": 5,
        "description": "YouTube is a comprehensive video-sharing platform that allows users to discover, upload, and stream videos across categories including music, education, entertainment, vlogs, gaming, and more. Users can create channels, build subscribers, monetize content through ads and memberships, and interact with communities via comments and live chats. YouTube supports high-quality streaming, content recommendations, playlists, and offline viewing. The platform constantly evolves with updates that enhance performance, security, and user experience, making it a premier hub for learning, entertainment, and creator-driven engagement worldwide.",
        "size": 153.2,
        "reviews": "1.78M",
        "ratingAvg": 4.27,
        "downloads": "5B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 53413
            },
            {
                "name": "2 star",
                "count": 71284
            },
            {
                "name": "3 star",
                "count": 142568
            },
            {
                "name": "4 star",
                "count": 624154
            },
            {
                "name": "5 star",
                "count": 841
            }
        ]
    },
    {
        "image": "/Gmail.png",
        "title": "Gmail",
        "companyName": "Google LLC",
        "id": 6,
        "description": "Gmail is an advanced email service that helps users manage personal and professional communications efficiently. It offers features such as organized inbox, priority filters, labels, smart search, spam protection, integration with Google Workspace, and cloud-based storage. Users can collaborate on documents, schedule events, and manage tasks seamlessly. Regular updates enhance security, performance, and usability, making Gmail a reliable platform for communication, productivity, and workflow management across devices.",
        "size": 27.5,
        "reviews": "186K",
        "ratingAvg": 4.27,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 5587
            },
            {
                "name": "2 star",
                "count": 7449
            },
            {
                "name": "3 star",
                "count": 14899
            },
            {
                "name": "4 star",
                "count": 65184
            },
            {
                "name": "5 star",
                "count": 100121
            }
        ]
    },
    {
        "image": "/GoogleMaps.png",
        "title": "Google Maps",
        "companyName": "Google LLC",
        "id": 7,
        "description": "Google Maps is a comprehensive navigation and mapping platform that helps users explore cities, neighborhoods, and remote locations with real-time GPS directions, traffic updates, and local recommendations. It offers features like turn-by-turn navigation, route planning, street view, offline maps, and location sharing. Users can discover restaurants, shops, hotels, and landmarks, view reviews, photos, and ratings, and receive personalized suggestions based on preferences. Businesses can update profiles, interact with customers, and analyze traffic insights. Regular updates improve accuracy, performance, and user experience, making Google Maps an essential tool for travel, commuting, and location discovery worldwide.",
        "size": 309.1,
        "reviews": "412K",
        "ratingAvg": 4.27,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 12360
            },
            {
                "name": "2 star",
                "count": 16480
            },
            {
                "name": "3 star",
                "count": 32960
            },
            {
                "name": "4 star",
                "count": 144201
            },
            {
                "name": "5 star",
                "count": 222
            }
        ]
    },
    {
        "image": "/Spotify.png",
        "title": "Spotify",
        "companyName": "Spotify Ltd.",
        "id": 8,
        "description": "Spotify is a leading music streaming platform that allows users to listen to millions of songs, podcasts, and audio content from artists worldwide. Users can create playlists, follow favorite artists, discover new releases, and enjoy personalized recommendations through AI-driven algorithms. The platform supports offline playback, high-quality audio streaming, collaborative playlists, and cross-device synchronization. Spotify also provides analytics and monetization tools for creators, enabling them to grow their audience. Regular updates enhance user experience, performance, and security, making Spotify a go-to platform for music lovers, podcasters, and creators globally.",
        "size": 83.9,
        "reviews": "162K",
        "ratingAvg": 4.27,
        "downloads": "500M+",
        "ratings": [
            {
                "name": "1 star",
                "count": 4873
            },
            {
                "name": "2 star",
                "count": 6497
            },
            {
                "name": "3 star",
                "count": 12995
            },
            {
                "name": "4 star",
                "count": 56852
            },
            {
                "name": "5 star",
                "count": 87919
            }
        ]
    },
    {
        "image": "/Snapchat.png",
        "title": "Snapchat",
        "companyName": "Snap Inc.",
        "id": 9,
        "description": "Snapchat is a multimedia messaging app that allows users to share photos, short videos, and interactive content with friends and followers. The platform offers stories, chat features, AR lenses, filters, and Bitmoji avatars to enhance user engagement. Users can discover trending content, news, and entertainment through the Discover section. Snapchat also supports private communication, ephemeral messages, and creative content sharing. Businesses and creators can leverage Snapchat Ads and analytics to reach audiences effectively. Regular updates focus on enhancing security, performance, and user experience, making Snapchat a dynamic social and creative platform.",
        "size": 74.6,
        "reviews": "192K",
        "ratingAvg": 4.27,
        "downloads": "500M+",
        "ratings": [
            {
                "name": "1 star",
                "count": 5767
            },
            {
                "name": "2 star",
                "count": 7690
            },
            {
                "name": "3 star",
                "count": 15378
            },
            {
                "name": "4 star",
                "count": 67278
            },
            {
                "name": "5 star",
                "count": 101
            }
        ]
    },
    {
        "image": "/X.jpg",
        "title": "X (Twitter)",
        "companyName": "X Corp.",
        "id": 10,
        "description": "X (formerly Twitter) is a social networking platform where users share updates, news, opinions, and multimedia content in real time. It allows posting tweets, following accounts, engaging through likes, retweets, and replies, and joining trending conversations. Professionals use X to network, share insights, and stay informed with breaking news, while creators leverage the platform for audience growth and monetization. The app provides tools for personalization, privacy controls, analytics, and content discovery. Frequent updates enhance performance, user experience, and security, making X a key platform for social interaction, information sharing, and digital communication globally.",
        "size": 22.8,
        "reviews": "281K",
        "ratingAvg": 4.27,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 8456
            },
            {
                "name": "2 star",
                "count": 11275
            },
            {
                "name": "3 star",
                "count": 22550
            },
            {
                "name": "4 star",
                "count": 98656
            },
            {
                "name": "5 star",
                "count": 151939
            }
        ]
    },
    {
        "image": "/Telegram.jpg",
        "title": "Telegram",
        "companyName": "Telegram FZ-LLC",
        "id": 11,
        "description": "Telegram is a cloud-based messaging app designed for speed, security, and versatility. Users can send messages, photos, videos, and files of any type while maintaining privacy through end-to-end encryption. Telegram supports group chats, channels for broadcasting to unlimited audiences, bots for automation, and advanced media sharing. It also provides cross-device syncing, customizable themes, and extensive security settings. Telegram is widely used for both personal communication and professional collaboration, with constant updates that improve performance, security, user experience, and the introduction of innovative features.",
        "size": 84.4,
        "reviews": "430K",
        "ratingAvg": 4.27,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 12908
            },
            {
                "name": "2 star",
                "count": 17211
            },
            {
                "name": "3 star",
                "count": 34421
            },
            {
                "name": "4 star",
                "count": 150592
            },
            {
                "name": "5 star",
                "count": 226132
            }
        ]
    },
    {
        "image": "/zoom.png",
        "title": "Zoom Cloud Meetings",
        "companyName": "Zoom Video Communications, Inc.",
        "id": 12,
        "description": "Zoom Cloud Meetings is a video conferencing and collaboration platform that enables users to host and join meetings, webinars, and virtual events with high-quality video, audio, and screen sharing. It supports scheduling, recording, chat, and integrations with productivity tools for seamless workflow management. Businesses, educators, and individuals rely on Zoom for communication, remote work, and online learning. Continuous updates enhance performance, security, user experience, and introduce features such as virtual backgrounds, breakout rooms, and meeting analytics, making Zoom a versatile and reliable communication tool worldwide.",
        "size": 185.7,
        "reviews": "437K",
        "ratingAvg": 4.25,
        "downloads": "50M+",
        "ratings": [
            {
                "name": "1 star",
                "count": 13121
            },
            {
                "name": "2 star",
                "count": 17494
            },
            {
                "name": "3 star",
                "count": 34989
            },
            {
                "name": "4 star",
                "count": 153076
            },
            {
                "name": "5 star",
                "count": 214681
            }
        ]
    },
    {
        "image": "/MicrosoftTeams.jpg",
        "title": "Microsoft Teams",
        "companyName": "Microsoft Corporation",
        "id": 13,
        "description": "Microsoft Teams is a collaboration platform that integrates chat, video conferencing, file storage, and application integration to streamline teamwork. Users can communicate in channels, organize meetings, collaborate on documents in real time, and access apps for productivity. Teams supports project management, task tracking, notifications, and workflow automation. Frequent updates enhance usability, performance, security, and feature availability, making Microsoft Teams an essential platform for businesses, educators, and remote teams to communicate and collaborate efficiently.",
        "size": 228.6,
        "reviews": "119K",
        "ratingAvg": 4.27,
        "downloads": "100M+",
        "ratings": [
            {
                "name": "1 star",
                "count": 3582
            },
            {
                "name": "2 star",
                "count": 4776
            },
            {
                "name": "3 star",
                "count": 9552
            },
            {
                "name": "4 star",
                "count": 41789
            },
            {
                "name": "5 star",
                "count": 620
            }
        ]
    },
    {
        "image": "/LinkedIn.png",
        "title": "LinkedIn",
        "companyName": "LinkedIn Corporation",
        "id": 14,
        "description": "LinkedIn is a professional networking platform that enables users to connect with colleagues, industry leaders, and potential employers. Users can share content, post updates, apply for jobs, and participate in groups and discussions. LinkedIn provides tools for professional growth, networking, and skill development, including LinkedIn Learning. Businesses can recruit talent, share company updates, and analyze engagement. Regular updates enhance security, performance, user experience, and introduce new networking features, making LinkedIn an essential tool for career advancement and professional networking.",
        "size": 144.2,
        "reviews": "321K",
        "ratingAvg": 4.27,
        "downloads": "500M+",
        "ratings": [
            {
                "name": "1 star",
                "count": 9655
            },
            {
                "name": "2 star",
                "count": 12866
            },
            {
                "name": "3 star",
                "count": 25731
            },
            {
                "name": "4 star",
                "count": 112644
            },
            {
                "name": "5 star",
                "count": 164944
            }
        ]
    },
    {
        "image": "/Netflix.png",
        "title": "Netflix",
        "companyName": "Netflix, Inc.",
        "id": 15,
        "description": "Netflix is a streaming platform that provides a vast library of movies, TV shows, documentaries, and original content across multiple genres. Users can stream on-demand, create profiles, manage watchlists, and receive personalized recommendations based on viewing habits. Netflix supports multiple devices, offline downloads, and adaptive streaming quality. Frequent updates enhance app performance, user experience, security, and the introduction of new features for content discovery, playback, and recommendations, making Netflix a global leader in entertainment streaming.",
        "size": 96.7,
        "reviews": "218K",
        "ratingAvg": 4.27,
        "downloads": "500M+",
        "ratings": [
            {
                "name": "1 star",
                "count": 6554
            },
            {
                "name": "2 star",
                "count": 8740
            },
            {
                "name": "3 star",
                "count": 17481
            },
            {
                "name": "4 star",
                "count": 76665
            },
            {
                "name": "5 star",
                "count": 114032
            }
        ]
    },
    {
        "image": "/AmazonShopping.jpg",
        "title": "Amazon Shopping",
        "companyName": "Amazon.com, Inc.",
        "id": 16,
        "description": "Amazon Shopping is an e-commerce app that allows users to browse, compare, and purchase millions of products including electronics, clothing, books, and household items. It offers features like secure payment, order tracking, personalized recommendations, wishlists, and customer reviews. Users can benefit from deals, promotions, and Amazon Prime benefits such as faster delivery and exclusive content. Frequent updates improve app performance, security, user experience, and introduce new shopping tools, making Amazon a global hub for online retail and seamless shopping experiences.",
        "size": 68.3,
        "reviews": "390K",
        "ratingAvg": 4.27,
        "downloads": "1B+",
        "ratings": [
            {
                "name": "1 star",
                "count": 11704
            },
            {
                "name": "2 star",
                "count": 15539
            },
            {
                "name": "3 star",
                "count": 31027
            },
            {
                "name": "4 star",
                "count": 136542
            },
            {
                "name": "5 star",
                "count": 196308
            }
        ]
    },
    {
        "image": "/Airbnb.png",
        "title": "Airbnb",
        "companyName": "Airbnb, Inc.",
        "id": 17,
        "description": "Airbnb is a platform that connects travelers with hosts offering accommodations and experiences worldwide. Users can book apartments, homes, unique stays, and guided experiences with detailed descriptions, reviews, and ratings. Hosts can manage listings, communicate with guests, and offer amenities and services. Airbnb provides tools for secure payments, flexible bookings, and personalized recommendations. Regular updates improve app performance, security, usability, and introduce innovative features for travel planning and booking, making Airbnb a trusted global platform for unique travel experiences.",
        "size": 77.2,
        "reviews": "153K",
        "ratingAvg": 4.27,
        "downloads": "100M+",
        "ratings": [
            {
                "name": "1 star",
                "count": 4599
            },
            {
                "name": "2 star",
                "count": 6132
            },
            {
                "name": "3 star",
                "count": 12266
            },
            {
                "name": "4 star",
                "count": 53649
            },
            {
                "name": "5 star",
                "count": 80038
            }
        ]
    },
    {
        "image": "/Uber.png",
        "title": "Uber",
        "companyName": "Uber Technologies, Inc.",
        "id": 18,
        "description": "Uber is a ride-hailing and mobility platform offering safe, cashless rides, food delivery, and on-demand services. Users can request rides, track drivers in real-time, and pay seamlessly through the app. Uber also supports shared rides, premium options, and Uber Eats for food delivery. It provides convenience, transparency, and innovative transport solutions for cities worldwide, constantly enhancing safety and service features. Regular updates improve performance, security, and introduce new features to enhance the overall user experience.",
        "size": 140.6,
        "reviews": "281K",
        "ratingAvg": 4.27,
        "downloads": "500M+",
        "ratings": [
            {
                "name": "1 star",
                "count": 8435
            },
            {
                "name": "2 star",
                "count": 11247
            },
            {
                "name": "3 star",
                "count": 22495
            },
            {
                "name": "4 star",
                "count": 99010
            },
            {
                "name": "5 star",
                "count": 144
            }
        ]
    }
]